Repository: itszhdi/Oqyga
Catalog: oqyga_frontend/lib/l10n/intl_*.arb
Languages: kk

# usernameLabel
source: Username
kk: Paıdalanýshy aty

# passwordLabel
source: Password
kk: Qupıa sóz

source: Forgot password?
kk: Qupıa sózdi umyttyńyz ba?

# signInButton
source: Sign In
kk: Kirý

# noAccountLink
source: No account?
kk: Tirkeldi joq pa?

# emptyError
source: Enter {field}
kk: {field} engizińiz

# passwordError
source: Password must be at least 8 characters
kk: Qupıa sóz keminde 8 tańbadan turýy tıis

# phoneEmpty
source: Enter phone number
kk: Telefon nómirin engizińiz

# passwordEmpty
source: Enter password
kk: Qupıa sózdi engizińiz

# passwordLength
source: Password must be at least 8 characters
kk: Qupıa sóz keminde 8 tańbadan turýy tıis

# phoneLabel
source: Phone number
kk: Telefon nómiri

# confirmPasswordLabel
source: Confirm password
kk: Qupıa sózdi rastańyz

# passwordsDoNotMatchError
source: Passwords do not match
kk: Qupıa sózder sáikes kelmeıdi

# signUpButton
source: Sign Up
kk: Tirkelý

# alreadyHaveAccountLink
source: Already have an account?
kk: Akkaýnt bar ma?

# usernameEmpty
source: Enter username
kk: Paıdalanýshy atyn engizińiz

# confirmPasswordEmpty
source: Confirm your password
kk: Qupıa sózdi rastańyz

# signUpError
source: Sign-up error: {errorMessage}
kk: Tirkelý qatesi: {errorMessage}

# signUpSuccess
source: Registration successful!
kk: Tirkelý sátti ótti!

# signInError
source: Sign-in error: {errorMessage}
kk: Kirý qatesi: {errorMessage}

# signInSuccess
source: Login successful!
kk: Kirý sátti ótti!

# unexpectedError
source: An unexpected error occurred
kk: Kútpegen qate oryn aldy

# invalidCredentialsError
source: Invalid username or password
kk: Login nemese qupıa sóz qate

# signInFailedError
source: Sign-in failed!
kk: Kirý qatesi!

# signUpFailedError
source: Registration failed
kk: Tirkelý qatesi

# tokenRefreshFailedError
source: Failed to refresh token
kk: Token jańartý sátsiz

source: Failed to get events
kk: Is-sharalardy alý sátsiz

source: Network error
kk: Jeli qatesi

source: Failed to get event
kk: Is-sharany alý sátsiz

# failedToLoadMyEvents
source: Error loading your events
kk: Is-sharalaryńyzdy júkteý qatesi

# untitledEvent
source: Untitled
kk: Ataýsyz

source: No description
kk: Sıpattama joq

source: Address not specified
kk: Mekenjaı kórsetilmegen

source: City not specified
kk: Qala kórsetilmegen

# ticketTypeStandard
source: Standard
kk: Standart

source: Invalid event ID
kk: Is-shara ID qate

# errorPrefix
source: Error:
kk: Qate:

source: Event not found
kk: Is-shara tabylmady

source: Buy Ticket
kk: Bılet satyp alý

source: Event has passed
kk: Is-shara ótip ketti

source: Sold Out
kk: Bıletter satylyp ketti

source: Find your event
kk: Óz is-sharańyzdy tabyńyz

source: Error loading events!
kk: Is-sharalardy júkteý qatesi!

# noEventsFoundForQuery
source: No events found for your request
kk: Suraý boıynsha is-sharalar tabylmady

# eventListIsEmpty
source: The event list is empty
kk: Is-sharalar tizimi bos

source: Failed to load cities
kk: Qalalardy júkteý sátsiz

source: Failed to load categories
kk: Sanattardy júkteý sátsiz

source: Failed to load age restrictions
kk: Jas shekteýlerin júkteý sátsiz

source: Failed to load filter options
kk: Súzgileý opsıalaryn júkteý sátsiz

# priceLabel
source: Price
kk: Baǵa

# priceFromHint
source: From
kk: Bastap

# priceToHint
source: To
kk: Deıin

# cityLabel
source: City
kk: Qala

# timeLabel
source: Time
kk: Waqyt

# dateRangeHint
source: Date - Date
kk: Kúni - Kúni

# timeRangeHint
source: Time - Time
kk: Waqyt - Waqyt

# filterButtonText
source: Filter
kk: Súzgileý

# retryButton
source: Retry
kk: Qaıtalaý

# eventFiltersTitle
source: Event Filters
kk: Is-shara súzgileri

# categoryLabel
source: Category
kk: Sanat

# ageRestrictionLabel
source: Age Restriction
kk: Jas shekteýi

# organizerFiltersTitle
source: Organizer Filters
kk: Uıymdastyrýshy súzgileri

# venueLabel
source: Venue
kk: Ótkizý orny

# ticketFiltersTitle
source: Ticket Filters
kk: Bılet súzgileri

# statusLabel
source: Status
kk: Mártebe

# statusActive
source: Active
kk: Belsendi

# statusInactive
source: Inactive
kk: Belsendi emes

# failedToSendOtp
source: Failed to send code
kk: Kod jiberý sátsiz

# invalidOtp
source: Invalid code
kk: Kod qate

source: Failed to reset password
kk: Qupıa sózdi qalpyna keltirý sátsiz

# passwordResetSuccess
source: Password successfully changed!
kk: Qupıa sóz sátti ózgertildi!

# resetPasswordTitle
source: Reset Password
kk: Qupıa sózdi qalpyna keltirý

# enterPhoneToResetDescription
source: Enter your phone number to receive a verification code.
kk: Rastaý kodyn alý úshin telefon nómirińizdi engizińiz.

# sendCodeButton
source: Send Code
kk: Kod jiberý

source: Field cannot be empty
kk: Óris bos bolmaýy tıis

# otpSentDescription
source: We sent a code to {phoneNumber}. Enter it below.
kk: Biz {phoneNumber} nómirine kod jiberdik. Ony tómende engizińiz.

# otpLabel
source: Verification code
kk: Rastaý kody

# enterOtpError
source: Enter code
kk: Kodty engizińiz

# confirmButton
source: Confirm
kk: Rastaý

# newPasswordTitle
source: New Password
kk: Jańa qupıa sóz

# enterNewPasswordDescription
source: Enter your new password
kk: Jańa qupıa sózińizdi engizińiz

# newPasswordLabel
source: New Password
kk: Jańa qupıa sóz

# saveButton
source: Save
kk: Saqtaý

source: Error loading tickets
kk: Bıletterdi júkteý qatesi

# errorLoadingTicketDetails
source: Failed to load ticket details
kk: Bılet derekterin júkteý sátsiz

# errorLoadingQrCode
source: Failed to load QR code
kk: QR-kodty júkteý sátsiz

source: Error purchasing ticket
kk: Bılet satyp alý qatesi

# noTicketPriceInfo
source: No ticket price information
kk: Bılet baǵalary týraly aqparat joq

source: User not authorized
kk: Paıdalanýshy avtorızatsıadan ótpegen

source: Seats not selected
kk: Oryndar tańdalmaǵan

source: Poster not found
kk: Poster tabylmady

# stageLabel
source: STAGE
kk: SAHNA

# seatSelected
source: Selected
kk: Tańdaldy

# seatBooked
source: Booked
kk: Brondaldy

# seatTooltip
source: Row: {row}, Seat: {number}, Price: {price} ₸
kk: Qatar: {row}, Oryn: {number}, Baǵa: {price} ₸

source: Seat in hall
kk: Zaldaǵy oryn

source: Ticket count
kk: Bılet sany

# showTicketToStaff
source: Show the ticket to our staff!
kk: Bıletti qyzmetkerimizge kórsetińiz!

# myTicketTitle
source: My Ticket
kk: Meniń bıletim

# myTicketsTitle
source: My Tickets
kk: Meniń bıletterim

# noTicketsFound
source: No tickets found for your request
kk: Suraý boıynsha bıletter tabylmady

# noTicketsYet
source: You have no purchased tickets yet
kk: Sizde ázirge satyp alyńǵan bıletter joq

# ticketStatusActive
source: Active
kk: Belsendi

# processingPayment
source: Processing...
kk: Óńdelýde...

# payButton
source: Pay {amount} ₸
kk: Tóleý {amount} ₸

# choosePaymentMethod
source: Please select a payment method
kk: Tólem ádisin tańdańyz

# serviceFeeLabel
source: Service fee (10%)
kk: Qyzmet kórsetý (10%)

# totalPriceLabel
source: Total price
kk: Jalpy quny

# seatsNotSelectedLabel
source: Seats not selected
kk: Oryndar tańdalmaǵan

# seatRowAndNumber
source: Row {row}, Seat {number}
kk: Qatar {row}, Oryn {number}

# ticketBookingTitle
source: Ticket Booking
kk: Bıletti resimdeý

# selectedSeatsDescription
source: {count} ticket(s): row {row}, seat {number}...
kk: {count} bılet: {row}-qatar, {number}-oryn...

# totalPriceWithCount
source: {count} ticket(s): {amount} ₸
kk: {count} bılet: {amount} ₸

# checkoutButton
source: Checkout
kk: Resimdeý

source: Search
kk: Izdeý

# selectAtLeastOneSeat
source: Please select at least one seat
kk: Kem degende bir oryn tańdańyz

# noDataForTicket
source: No data to display ticket.
kk: Bıletti kórsetý úshin derekter joq.

source: Error loading profile
kk: Profildi júkteý qatesi

source: Error updating profile
kk: Profildi jańartý qatesi

# errorChangingPassword
source: Failed to change password
kk: Qupıa sózdi aýystyrý sátsiz

# errorUploadingPhoto
source: Failed to upload photo
kk: Fotony júkteý sátsiz

# errorUploadingPhotoWithReason
source: Error uploading photo: {reason}
kk: Foto júkteý qatesi: {reason}

source: Uploading photo...
kk: Foto júktelýde...

source: Saving changes...
kk: Ózgerister saqtalýda...

source: Changing password...
kk: Qupıa sóz aýystyrylýda...

# photoUpdatedSuccess
source: Photo updated successfully
kk: Foto sátti jańartyldy

# profileUpdatedSuccess
source: Profile updated successfully
kk: Profil sátti jańartyldy

# passwordChangedSuccess
source: Password changed successfully
kk: Qupıa sóz sátti ózgertildi

# profileTitle
source: Profile
kk: Profil

# yourDataTitle
source: Your Data
kk: Sizdiń derekterińiz

# editProfileTitle
source: Edit
kk: Ózgertý

# changePasswordTitle
source: Change Password
kk: Qupıa sózdi aýystyrý

# logoutButton
source: Log Out
kk: Shyǵý

# logoutDialogTitle
source: Do you really want to log out?
kk: Shynynda da shyqqyńyz kele me?

# noButton
source: No
kk: Joq

# yesLogoutButton
source: Log Out
kk: Shyǵý

# changePhotoLabel
source: Change Photo
kk: Fotony ózgertý

source: Not specified
kk: Kórsetilmegen

# paymentMethodsTitle
source: Payment Methods
kk: Tólem ádisteri

source: Your Cards
kk: Sizdiń kartalaryńyz

# appLanguageTitle
source: App Language
kk: Qosymsha tili

# currentPasswordLabel
source: Current Password
kk: Aǵymdaǵy qupıa sóz

source: Error creating event
kk: Is-shara qurý qatesi

source: Error updating event
kk: Is-shara jańartý qatesi

# errorDeletingEvent
source: Failed to delete event
kk: Is-shara óshirý sátsiz

# errorLoadingVenues
source: Failed to load venues list
kk: Oryndar tizimin júkteý sátsiz

# addEventTitle
source: Add Event
kk: Is-shara qosý

# editEventTitle
source: Edit Event
kk: Is-sharany ózgertý

# eventCreatedSuccess
source: Event successfully created!
kk: Is-shara sátti quryldy!

# eventUpdatedSuccess
source: Event successfully updated!
kk: Is-shara sátti jańartyldy!

# organizerTitle
source: Organizer
kk: Uıymdastyrýshy

# yourOrganizationTitle
source: Your Organization
kk: Sizdiń uıym

# organizationNameLabel
source: Organization Name
kk: Uıym ataýy

# maxTicketCategoriesError
source: Maximum 5 price categories
kk: Eń kóbi 5 baǵa sanaty

# addPosterAndTitleError
source: Add a poster and fill in the title
kk: Poster qosyp, ataýyn toltyryńyz

# fillAllTicketDataError
source: Fill in data for all ticket categories
kk: Barlyq bılet sanattarynyń derekterin toltyryńyz

# basicInfoTitle
source: Basic Information
kk: Negizgi aqparat

# eventNameHint
source: Event Name
kk: Is-shara ataýy

# dateHint
source: Date
kk: Kúni

# timeHint
source: Time
kk: Waqyt

# chooseCityHint
source: Choose City
kk: Qalany tańdańyz

# categoryHint
source: Category
kk: Sanat

# venueAddressHint
source: Venue Address
kk: Ótkizý orny

# pricesAndTicketsTitle
source: Prices and Tickets
kk: Baǵalar jáne bıletter

# ticketNameHint
source: Name (e.g. VIP, Standard)
kk: Ataýy (mys. VIP, Kirý)

# deleteCategoryTooltip
source: Delete Category
kk: Sanatty óshirý

# priceHint
source: Price
kk: Baǵa

# seatsAmountHint
source: Seats (qty)
kk: Oryn (dana)

# addPriceCategoryButton
source: Add Price Category
kk: Baǵa sanatyn qosý

# standardTicketName
source: Standard
kk: Standart

# descriptionTitle
source: Description
kk: Sıpattama

# eventDescriptionHint
source: Tell about the event...
kk: Is-shara týraly aıtyp berińiz...

# myEventsTitle
source: My Events
kk: Meniń is-sharalarym

# noEventsFound
source: No events found for your request
kk: Suraý boıynsha is-sharalar tabylmady

# noCreatedEvents
source: You haven't created any events yet
kk: Sizde ázirge qurylǵan is-sharalar joq

# deleteConfirmationTitle
source: Delete Confirmation
kk: Óshirýdi rastaý

# deleteEventConfirmation
source: Do you really want to delete "{itemName}"?
kk: "{itemName}" is-sharasyn shynynda da óshirgińiz kele me?

# deleteButton
source: Delete
kk: Óshirý

# cancelButton
source: Cancel
kk: Boldyrmaý

source: Change Poster
kk: Posterdi ózgertý

source: Add Poster
kk: Poster qosý

source: Language
kk: Til

source: Choose language
kk: Tildi tañdañyz

source: Failed to get cards
kk: Kartalardy alý múmkin bolmady

source: Failed to create payment method
kk: Kartany qosý múmkin bolmady

source: My Cards
kk: Meniń kartalarym

source: New Card
kk: Jańa karta

# cardAddedSuccess
source: Card added successfully
kk: Karta sátti qosylǵan

source: Invalid date format
kk: Dúk kúni formaty jasalmaǵan

source: Error adding card
kk: Kartany qosý qatesi

# cardNumberLabel
source: Card Number
kk: Karta nomeri

# expiryDateLabel
source: Expiry Date (MM/YY)
kk: Jaramdylyq Merzimi (MM/YY)

source: Link Card
kk: Silteme Kartasy

source: Enter Card Number
kk: Karta Nómirin Engizińiz

# cardNumberTooShort
source: Card number is too short
kk: Karta nómiri tym qysqa

source: Invalid card number
kk: Kartanyń nómiri jaramsyz

# fieldRequired
source: Field is required
kk: Óris qajet

source: Invalid format
kk: Jaramsyz format

source: Invalid CVV
kk: Jaramsyz CVV

# cardsTitle
source: Cards
kk: Kartalar

source: No saved cards
kk: Saqtalǵan kartalar joq

# oneTimeCard
source: New card (one-time)
kk: Jańa karta (bir rettik)

source: Add card
kk: Kartany qosý

# saveCardForLater
source: Save card for future payments
kk: Kartańyzdy bolashaqta paıdalaný úshin saqtańyz

# confirm_city_title
source: Is your city {cityName}?
kk: Sizdin qalańyz {cityName} ma?

# confirm_city_content
source: Show events in this city?
kk: Osy qaladaǵy is-sharalardy kórsetý kerek pe?

# select_city_title
source: Select a city
kk: Qalany tańdańyz

source: Yes
kk: Iá

source: No
kk: Joq

source: Loading...
kk: Júktelýde...

# go_to_event
source: Go to
kk: Ótý

# enterPromoCodeTitle
source: Enter promo code
kk: Promokodty engizińiz

# promoCodeHint
source: Promo code
kk: Promokod

# applyButton
source: Apply
kk: Qoldaný

# enterPromoCodeButton
source: Enter promo code
kk: Promokodty engizý

# appliedPromoCodeLabel
source: Promo code: {code}
kk: Jarnamalyq kod: {code}

# promoCodeSuccess
source: Promo code applied!
kk: Promokod qabyldandy!

# discountLabel
source: Discount ({percent}%)
kk: Jeńildik ({percent}%)
