----------------------------------------------------------------------
-- Добавление городов
----------------------------------------------------------------------

INSERT INTO cities (city_name) VALUES
('Астана'),
('Алматы'),
('Актобе'),
('Актау'),
('Караганда'),
('Кокшетау'),
('Костанай'),
('Павлодар'),
('Семей'),
('Ташкент'),
('Тараз'),
('Талдыкорган'),
('Шымкент'),
('Усть-Каменогорск');

----------------------------------------------------------------------
-- Добавление категорий
----------------------------------------------------------------------

INSERT INTO categories (category_name) VALUES
('Кино'),
('Театры'),
('Концерты'),
('STAND UP'),
('Спорт'),
('Бизнес-форумы'),
('Выставки'),
('Мастер-классы'),
('Детям'),
('Развлечения');

----------------------------------------------------------------------
-- Добавление возрастных ограничений
----------------------------------------------------------------------

INSERT INTO age_restrictions (age_category) VALUES
('0+'),
('6+'),
('12+'),
('14+'),
('16+'),
('18+'),
('21+');