----------------------------------------------------------------------
-- Добавление языков
----------------------------------------------------------------------

INSERT INTO languages (language) VALUES
('English'),
('Русский язык'),
('Қазақ тілі');

----------------------------------------------------------------------
-- Добавление промокодов
----------------------------------------------------------------------

INSERT INTO promocodes (promocode, price_charge) VALUES
('Oqyshy5',0.05),
('Alash10',0.10),
('AtaAnalar15',0.15),
('PepsiCola3',0.03);


